In [1]:
#### Q1. List any five functions of the pandas library with execution.

In [2]:
import pandas as pd
data={
"Name":["Mari","prak","Siddhu"],
"Age":[27,30,15],
"Gender":["male","Male","Male"]
}

In [5]:
data=pd.DataFrame(data)

In [6]:
data.head()

     Name  Age Gender
0    Mari   27   male
1    prak   30   Male
2  Siddhu   15   Male

In [7]:
data.tail()

     Name  Age Gender
0    Mari   27   male
1    prak   30   Male
2  Siddhu   15   Male

In [8]:
data.iloc[0:1]

   Name  Age Gender
0  Mari   27   male

In [9]:
data.loc[0:1]

   Name  Age Gender
0  Mari   27   male
1  prak   30   Male

In [10]:
data.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

#### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re- index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

#### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column.

In [17]:
data={"values":[10,20,30,40,50,50]}
df=pd.DataFrame(data)


def fun3vauesadd(lst):
    if len(lst)>3:
        print("First three values sum is ", sum(lst[0:3]))

In [18]:
fun3vauesadd(df.values)

First three values sum is  [60]

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new  column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [35]:
data4={"Text":["Marimuthu","Prakash","Jack"]}
df4=pd.DataFrame(data4)
df4['Word_count']=df4['Text'].str.len()
df4

        Text  Word_count
0  Marimuthu           9
1    Prakash           7
2       Jack           4

#### Q5. How are DataFrame.size() and DataFrame.shape() different?
- size it will return the number of row x column
- shape its return rowscount , columncount

In [38]:
df4.shape

(3, 2)

In [40]:
df4.size

6

#### Q6. Which function of pandas do we use to read an excel file?
pd.read_excel("filename")

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [101]:
data7={
    "email":["mari@gamil.com","Praks@gmail.com","Queen@gmail.com"]
}

df7=pd.DataFrame(data7)
df7['username']=df7.email.str.partition("@")[0]

In [103]:
df7

             email username
0   mari@gamil.com     mari
1  Praks@gmail.com    Praks
2  Queen@gmail.com    Queen

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [109]:
data8={
 "A":[3,8,6,2,9],
 "B" :[5,2,9,3,1],
 "C":[1,7,4,5,2]   
}

df8=pd.DataFrame(data8)
df8

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [113]:
df8[(df8["A"]>5) & (df8["B"]<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [121]:
data9={"values":[1,3,5,6,8,9,90]}
df9=pd.DataFrame(data9)
df9.describe()

          values
count   7.000000
mean   17.428571
std    32.118827
min     1.000000
25%     4.000000
50%     6.000000
75%     8.500000
max    90.000000

In [115]:
df9['values'].mean()

17.428571428571427

In [123]:
df9['values'].median()

6.0

In [122]:
import numpy as np
np.std(df9['values'])

29.736255614303282

#### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [126]:
data11={"Date":["2023-01-01","2023-01-02","2023-01-03" ,"2023-01-04", "2023-01-05"]}
df11=pd.DataFrame(data11)

In [150]:
df11['WeeKdays']=pd.to_datetime(df11['Date']).dt.strftime('%A')

In [151]:
df11.head()

         Date   WeeKdays
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [153]:
##Using Q11 data frame
df11.head()

         Date   WeeKdays
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

In [155]:
df11[(df11['Date']>'2023-01-01') &(df11['Date']<'2023-01-31')]

         Date   WeeKdays
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

#### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

In [157]:
import pandas as pd